const n=`---
tag: Πανδώρα 2025
title: Ολοκληρώθηκε η τελική φάση «Πανδώρα 2025»
---
Το Σάββατο 3 Μαΐου 2025 πραγματοποιήθηκε η τελική φάση του 1ου Πανελλήνιου Μαθητικού Διαγωνισμού Τεχνητής Νοημοσύνης, [«Πανδώρα 2025»](/contests/pdtn25b), με τη συμμετοχή 90 μαθητών που προκρίθηκαν από την προκαταρκτική φάση.

Τα αποτελέσματα και η Εθνική Ομάδα που θα εκπροσωπήσει τη χώρα μας στη Διεθνή Ολυμπιάδα Τεχνητής Νοημοσύνης βρίσκονται στη [σελίδα της διοργάνωσης 2025](/editions/2025). Ευχαριστούμε όλους τους μαθητές για τη συμμετοχή τους!
`;export{n as default};
