const n=`---
tag: Πανδώρα 2026
title: Ολοκληρώθηκε η τελική φάση «Πανδώρα 2026»
---
Το Σάββατο 25 Απριλίου 2026 πραγματοποιήθηκε η τελική φάση του 2ου Πανελλήνιου Μαθητικού Διαγωνισμού Τεχνητής Νοημοσύνης, [«Πανδώρα 2026»](/contests/pdtn26b), με τη συμμετοχή 63 μαθητών που προκρίθηκαν από την προκαταρκτική φάση.

Τα αποτελέσματα και η Εθνική Ομάδα που θα εκπροσωπήσει τη χώρα μας στους διεθνείς διαγωνισμούς βρίσκονται στη [σελίδα της διοργάνωσης 2026](/editions/2026). Ευχαριστούμε όλους τους μαθητές για τη συμμετοχή τους!
`;export{n as default};
