const n=`# Επιτροπές

Τα μέλη των επιτροπών του Πανελληνίου Διαγωνισμού Τεχνητής Νοημοσύνης (ΠΔΤΝ) για την σχολική χρονιά 2025-2026 είναι τα εξής:

<div class="flex flex-col md:flex-row gap-4">
<div class="flex-1">

## Οργανωτική Επιτροπή

#### Πρόεδρος
- **Σελλής Τίμος**  
  Διευθυντής Ερευν. Μονάδας ΑΡΧΙΜΗΔΗΣ

#### Αντιπρόεδρος
- **Βογιατζής Ιωάννης**  
  Καθηγητής Πανεπιστημίου Δυτικής Αττικής - Πρόεδρος ΕΠΥ

#### Mέλη
- **Δρίβας Θανάσης**  
  Καθηγητής Πληροφορικής - Επιστημονικός Συνεργάτης ΙΑΑΔΕΤ
- **Ζέρβας Κωνσταντίνος**  
  Σύμβουλος Εκπαίδευσης Πληροφορικής ΠΕ86
- **Καραγεώργος Παναγιώτης**  
  Καθηγητής Πληροφορικής - Αντιπρόεδρος ΕΠΥ
- **Καραμανής Κωνσταντίνος**  
  Καθηγητής University Texas Austin και ΑΡΧΙΜΗΔΗΣ/ΕΚ ΑΘΗΝΑ
- **Καραταπάνης Κωστής**  
  ΑΡΧΙΜΗΔΗΣ/ΕΚ ΑΘΗΝΑ
- **Καρυπίδης Στάθης**  
  ΕΜΠ και ΑΡΧΙΜΗΔΗΣ/ΕΚ ΑΘΗΝΑ
- **Κελέσης Δημήτρης**  
  ΕΜΠ
- **Κορομηλάς Παναγιώτης**  
  ΕΚΠΑ
- **Λώλος Ανδρέας**  
  ΕΚΠΑ και ΑΡΧΙΜΗΔΗΣ/ΕΚ ΑΘΗΝΑ
- **Μελετίου Γεώργιος**  
  ΕΠΥ
- **Μοσχόβης Γιώργος**  
  ΑΡΧΙΜΗΔΗΣ/ΕΚ ΑΘΗΝΑ
- **Παντής Γεώργιος**  
  ΕΚΠΑ και ΑΡΧΙΜΗΔΗΣ/ΕΚ ΑΘΗΝΑ
- **Παυλόπουλος Ιωάννης**  
  Επικ. Καθηγητής ΟΠΑ και ΑΡΧΙΜΗΔΗΣ/ΕΚ ΑΘΗΝΑ
- **Πλα-Καρύδη Δανάη**  
  ΑΡΧΙΜΗΔΗΣ/ΕΚ ΑΘΗΝΑ
- **Πλάτανος Χαράλαμπος**  
  ΕΜΠ και ΑΡΧΙΜΗΔΗΣ/ΕΚ ΑΘΗΝΑ
- **Σουφλερή Ευσταθία**  
  ΟΠΑ και ΑΡΧΙΜΗΔΗΣ/ΕΚ ΑΘΗΝΑ
- **Τζάμος Χρήστος**  
  Αναπλ. Καθηγητής ΕΚΠΑ και ΑΡΧΙΜΗΔΗΣ/ΕΚ ΑΘΗΝΑ
- **Τσικούρας Νίκος**  
  ΕΚΠΑ και ΑΡΧΙΜΗΔΗΣ/ΕΚ ΑΘΗΝΑ
- **Φωτάκης Δημήτρης**  
  Καθηγητής ΕΜΠ και ΑΡΧΙΜΗΔΗΣ/ΕΚ ΑΘΗΝΑ
- **Χατζηπαπαδοπούλου Άννα**  
  ΟΠΑ και ΑΡΧΙΜΗΔΗΣ/ΕΚ ΑΘΗΝΑ
- **Χλαπάνης Οδυσσέας**  
  ΟΠΑ και ΑΡΧΙΜΗΔΗΣ/ΕΚ ΑΘΗΝΑ

</div>
<div class="flex-1">

## Επιστημονική Επιτροπή

#### Πρόεδρος
- **Κατερίνα Πάστρα**  
  Ερευνήτρια ΙΕΛ/ΕΚ ΑΘΗΝΑ, Πρόεδρος ΕΕΤΝ 

#### Αντιπρόεδρος
- **Τζάμος Χρήστος**  
  Αναπλ. Καθηγητής ΕΚΠΑ και ΑΡΧΙΜΗΔΗΣ/ΕΚ ΑΘΗΝΑ

#### Mέλη
- **Βουλόδημος Αθανάσιος**  
  Επικ. Καθηγητής ΕΜΠ
- **Βούρος Γεώργιος**  
  Καθηγητής Παν. Πειραιά
- **Βραχάτης Αριστείδης**  
  Επίκ. Καθηγητής - Ιόνιο Πανεπιστήμιο
- **Δουκάκης Σπυρίδων**  
  Επικ. Καθηγητής - Ιόνιο Πανεπιστήμιο - Πρόεδρος ΙΕΠ
- **Γιαννακόπουλος Γεώργιος**  
  Ειδικός Λειτουργικός Επιστήμονας - ΕΚΕΦΕ ΔΗΜΟΚΡΙΤΟΣ
- **Εμίρης Ιωάννης**  
  Καθηγητής ΕΚΠΑ και ΕΚ ΑΘΗΝΑ
- **Καραμανής Κωνσταντίνος**  
  Καθηγητής University Texas Austin και ΑΡΧΙΜΗΔΗΣ/ΕΚ ΑΘΗΝΑ  
- **Κουμπαράκης Μανόλης**  
  Καθηγητής ΕΚΠΑ και ΑΡΧΙΜΗΔΗΣ/ΕΚ ΑΘΗΝΑ
- **Μόρμορης Εμμανουήλ**  
  Καθηγητής Πληροφορικής - ΕΠΥ
- **Παλιούρας Γεώργιος**  
  Διευθυντής Ερευνών ΕΚΕΦΕ ΔΗΜΟΚΡΙΤΟΣ
- **Παναγάκης Ιωάννης**  
  Αναπλ. Καθηγητής ΕΚΠΑ και ΑΡΧΙΜΗΔΗΣ/ΕΚ ΑΘΗΝΑ
- **Παυλόπουλος Ιωάννης**  
  Επικ. Καθηγητής ΟΠΑ και ΑΡΧΙΜΗΔΗΣ/ΕΚ ΑΘΗΝΑ
- **Περαντώνης Σταύρος**  
  Διευθυντής Ερευνών - ΕΚΕΦΕ ΔΗΜΟΚΡΙΤΟΣ
- **Σγουροπούλου Κλειώ**  
  Καθηγήτρια ΠΑΔΑ
- **Σελλής Τίμος**  
  Διευθυντής Ερευν. Μονάδας ΑΡΧΙΜΗΔΗΣ/ΕΚ ΑΘΗΝΑ
- **Στάμου Γεώργιος**  
  Καθηγητής ΕΜΠ
- **Σταφυλάκης Θέμος**  
  Αναπλ. Καθηγητής ΟΠΑ και ΑΡΧΙΜΗΔΗΣ/ΕΚ ΑΘΗΝΑ
- **Φωτάκης Δημήτρης**  
  Καθηγητής ΕΜΠ και ΑΡΧΙΜΗΔΗΣ/ΕΚ ΑΘΗΝΑ
- **Χατζηαφράτης Βάγγος**  
  Επ Καθηγητής UC Santa Cruz και ΑΡΧΙΜΗΔΗΣ/ΕΚ ΑΘΗΝΑ
</div></div>
`;export{n as default};
