const n=`surname,name,school,class
ΑΓΓΕΛΑΚΗΣ,ΓΕΩΡΓΙΟΣ,Πρότυπο Γενικό Λύκειο Ηρακλείου,Γ Λυκείου
ΒΑΝΔΩΡΟΣ,ΓΕΡΑΣΙΜΟΣ,Πρότυπο Λύκειο Βαρβακείου Σχολής,Β Λυκείου
ΒΙΤΩΡΑΤΟΣ,ΧΑΡΑΛΑΜΠΟΣ,Κολλέγιο Αθηνών,Β Λυκείου
ΓΚΟΥΓΚΟΥΛΙΑΣ,ΛΕΩΝ,1o Γενικό Λύκειο Παπάγου,Β Λυκείου
ΓΟΥΜΑΤΙΑΝΟΣ,ΑΓΓΕΛΟΣ,14o Γενικό Λύκειο Λάρισας,Α Λυκείου
ΔΡΑΓΑΣΑΚΗΣ,ΕΜΜΑΝΟΥΗΛ,2ο Πειραματικό Λύκειο Ιεράπετρας,Α Λυκείου
ΙΑΚΩΒΑΚΗΣ,ΛΑΜΠΡΟΣ,Εκπαιδευτική Αναγέννηση,Β Λυκείου
ΚΑΠΙΔΑΚΗ,ΕΛΕΝΗ,Πρότυπο Γυμνάσιο Βαρβακείου Σχολής,Α Γυμνασίου
ΛΥΚΟΓΕΩΡΓΟΣ,ΛΑΜΠΡΟΣ,2ο Γενικό Λύκειο Αγρινίου,Α Λυκείου
ΜΑΤΑΥΤΣΗΣ,ΧΡΗΣΤΟΣ,Ελληνογαλλική Σχολή Καλαμαρί,Γ Γυμνασίου
ΜΠΙΡΜΠΟΣ,ΧΡΗΣΤΟΣ,4ο Γενικό Λύκειο Ιωαννίνων,Β Λυκείου
ΣΑΡΡΑΣ,ΘΕΟΔΩΡΟΣ,Σχολή Μωραΐτη,Γ Λυκείου
ΤΑΝΑΚΙΔΗΣ,ΔΗΜΗΤΡΙΟΣ,Ελληνογαλλική Σχολή Καλαμαρί,Γ Γυμνασίου
ΤΖΟΒΑΪΡΗΣ,ΓΕΩΡΓΙΟΣ,Εκπαιδευτήρια Γείτονα,Β Λυκείου
ΤΡΑΥΛΟΣ,ΕΥΑΓΓΕΛΟΣ,Πρότυπο Γενικό Λύκειο Αναβρύτων,Β Λυκείου
ΦΟΥΣΚΙΤΑΚΗΣ,ΝΙΚΟΛΑΟΣ,Πειραματικό Γενικό Λύκειο Χανίων,Α Λυκείου
ΧΡΟΝΟΠΟΥΛΟΣ,ΙΩΑΝΝΗΣ,1ο Πρότυπο Λύκειο Αθήνας - Γεννάδειο,Α Λυκείου
`;export{n as default};
