const n=`surname,name,school,class
ΑΓΓΕΛΑΚΗΣ,ΓΕΩΡΓΙΟΣ,Πρότυπο Λύκειο Ηρακλείου,Β Λυκείου
ΑΛΕΞΟΠΟΥΛΟΣ,ΚΩΝΣΤΑΝΤΙΝΟΣ,Εκπαιδευτική Αναγέννηση,Α Λυκείου
ΑΠΟΣΤΟΛΙΔΗΣ,ΧΑΡΑΛΑΜΠΟΣ,Μουσικό Σχολείο Θεσσαλονίκης,Α Λυκείου
ΒΑΝΔΩΡΟΣ,ΓΕΡΑΣΙΜΟΣ,Βαρβάκειο Πρότυπο Λύκειο,Α Λυκείου
ΓΕΩΡΓΟΥΝΤΖΟΣ,ΑΛΕΞΑΝΔΡΟΣ,Σχολή Μωραΐτη,Α Λυκείου
ΓΚΟΥΓΚΟΥΛΙΑΣ,ΛΕΩΝ,1o ΓΕΛ Παπάγου,Α Λυκείου
ΓΟΥΜΑΤΙΑΝΟΣ,ΑΓΓΕΛΟΣ,15ο Γυμνάσιο Λάρισας,Γ Γυμνασίου
ΖΕΡΒΟΥ,ΣΟΦΙΑ-ΣΤΥΛΙΑΝΗ,Γενικό Λύκειο Σύρου,Α Λυκείου
ΚΑΤΕΡΗΣ,ΛΑΜΠΡΟΣ,Κολλέγιο Αθηνών,Γ Γυμνασίου
ΜΗΛΙΩΤΗΣ,ΑΣΤΕΡΙΟΣ,1ο Πρότυπο ΓΕΛ Μανόλης Ανδρόνικος,Β Λυκείου
ΜΗΤΣΙΟΣ,ΜΑΡΙΟΣ,4ο Πειραματικό ΓΕΛ Τρικάλων,Β Λυκείου
ΝΙΚΟΛΗΣ,ΓΕΩΡΓΙΟΣ,Αρσάκειο Γενικό Λύκειο Ψυχικού,Α Λυκείου
ΝΙΚΟΥ,ΠΡΟΜΗΘΕΑΣ,Εκπαιδευτήρια Ε. Μαντουλίδη,Γ Λυκείου
ΠΑΝΔΟΥΛΑΣ,ΕΥΑΓΓΕΛΟΣ,Σχολή Μωραΐτη IB,Β Λυκείου
ΠΑΠΑΔΑΚΗΣ,ΝΙΚΟΛΑΟΣ,Κολλέγιο Ψυχικού,Α Λυκείου
ΡΑΠΤΟΠΟΥΛΟΣ,ΣΤΥΛΙΑΝΟΣ,"Ιδιωτικό Λύκειο ""Νέα Παιδεία""",Α Λυκείου
ΣΑΡΡΑΣ,ΘΕΟΔΩΡΟΣ,Σχολή Μωραΐτη,Β Λυκείου
ΣΤΑΥΡΟΥ,ΚΩΝΣΤΑΝΤΙΝΟΣ,1ο Πρότυπο ΓΕΛ Μανόλης Ανδρόνικος,Β Λυκείου
ΤΑΝΑΚΙΔΗΣ,ΔΗΜΗΤΡΙΟΣ,Ελληνογαλλική Σχολή Καλαμαρί,Β Γυμνασίου
ΤΖΟΒΑΪΡΗΣ,ΓΕΩΡΓΙΟΣ,Εκπαιδευτήρια Γιαννόπουλου,Α Λυκείου
ΤΟΥΛΗΣ,ΔΗΜΗΤΡΙΟΣ,Εκπαιδευτήρια Ε. Μαντουλίδη,Γ Λυκείου
ΤΣΙΧΡΙΝΗΣ,ΧΡΗΣΤΟΣ,4ο Πειραματικό ΓΕΛ Τρικάλων,Β Λυκείου
ΦΙΩΤΑΚΗΣ,ΣΤΕΛΙΑΝΟΣ,Πρότυπο Λύκειο Αναβρύτων,Γ Λυκείου
`;export{n as default};
