const n=`Πολλές ιστοσελίδες προστατεύουν το περιεχόμενό τους χρησιμοποιώντας τα λεγόμενα "Captcha Challenges" -- προβλήματα που είναι σχετικά εύκολα για έναν άνθρωπο, αλλά δύσκολα για αυτοματοποιημένη διαδικασία, δηλαδή, αλγόριθμο. 

Ο στόχος της άσκησης είναι να δείξετε πως με τεχνικές της μηχανικής μάθησης, μπορούμε να "ξεπεράσουμε" αυτά τα εμπόδια. Δηλαδή, μπορούμε με αυτοματοποιημένο τρόπο να τα λύσουμε. Αυτό το πρόβλημα σας ζητάει να λύσετε μαθηματικά προβλήματα που παρουσιάζονται ως CAPTCHA εικόνες. Κάθε εικόνα περιέχει ένα πρόβλημα της μορφής "AB ± CD" όπου A, B, C, D είναι ψηφία (0-9) και το σύμβολο μπορεί να είναι πρόσθεση (+) ή αφαίρεση (-). Πρέπει να αναγνωρίσετε τα ψηφία και τον τελεστή από την εικόνα και να υπολογίσετε το αποτέλεσμα.

Μπορείτε να εισάγετε τις απαντήσεις σας χειροκίνητα κάτω από κάθε εικόνα για να δείτε πως λειτουργεί η βαθμολόγηση. Υπάρχουν πολλά προβλήματα -- 2.500 καθαρά (εύκολα) και 2.500 θορυβώδη (δύσκολα) προβλήματα, οπότε συνολικά 5.000 Captcha. 

**Πρόκληση**

Σχεδιάστε ένα σύστημα που βρίσκει τις λύσεις με αλγοριθμικό τρόπο, και ανεβάστε τις λύσεις μαζικά. Το κουμπί «Υποβολή από Αρχείο» δέχεται αρχεία JSON με την ακόλουθη δομή:

\`\`\`json
{
  "public-clean": "37+34=71\\n71+47=118\\n24+54=78\\n...",
  "public-noisy": "38-50=-12\\n79-55=24\\n73-08=65\\n...",
  "private-clean": "02+26=28\\n06+86=92\\n99-32=67\\n...",
  "private-noisy": "02-16=-14\\n37-60=-23\\n72-44=28\\n..."
}
\`\`\`

Κάθε κλειδί αντιστοιχεί σε ένα επίπεδο δυσκολίας (public-clean, public-noisy, private-clean, private-noisy) και περιέχει μια συμβολοσειρά με απαντήσεις διαχωρισμένες με αλλαγή γραμμής (\`\\n\`). Κάθε απάντηση έχει τη μορφή \`equation=result\` (π.χ. \`37+34=71\`).

Για να ξεκινήσετε άμεσα, μπορείτε να δημιουργήσετε ένα JSON αρχείο με αυτή τη δομή και να το ανεβάσετε. Το παραπάνω παράδειγμα περιέχει 3 λυμένα προβλήματα για κάθε επίπεδο δοκιμής.



**Αρχικές Ιδέες**

Το πρόβλημα της προσθαφαίρεσης είναι εύκολο (και εύκολα αυτοματοποιείται). Η ανίχνευση των ψηφίων είναι η ουσιαστική δυσκολία σε αυτά τα Captcha προβλήματα. Το βασικό ζητούμενο είναι να μπορούμε από την εικόνα να ξεχωρίσουμε τέσσερα ψηφία, και από αυτά να βρούμε τα ψηφία στα οποία αντιστοιχούν. Μια προσέγγιση είναι μέσω νευρωνικών δικτύων για το MNIST. Μπορείτε να αρχίσετε με το Colab Notebook που σας έχουμε ετοιμάσει. `;export{n as default};
