const n=`Θέλουμε να χρωματίσουμε ένα τετράγωνο πλευράς 1 χρησιμοποιώντας ένα νευρωνικό δίκτυο. Η συνάρτηση αντιστοιχίζει σε κάθε σημείο $(x,y)$ με $0 \\le x,y \\le 1$, τρεις τιμές χρωματικής φωτεινότητας $(r, g, b)$ με $0 \\le r, g, b \\le 1$ που αντιστοιχούν στην κόκκινη, στην πράσινη και στην μπλέ συνιστώσα.

Για την άσκηση θα χρησιμοποιήσουμε μια δοσμένη αρχιτεκτονική νεωρωνικού δικτύου ως συνάρτηση για να χρωματίσουμε το τετράγωνο. Το νευρωνικό δέχεται 2 εισόδους τις συντεταγμένες $(x,y)$ και βγάζει ως έξοδο 3 τιμές που αντιστοιχούν στις φωτεινότητες rgb. Στόχος σας είναι να εκπαιδεύσετε μια τέτοια αρχιτεκτονική για κάθε εικόνα έτσι ώστε να οδηγήσει σε όσο πιο πιστή αναπαράσταση της εικόνας μπορείτε.
\`\`\`
nn.Sequential(
  nn.Linear(2, 10),    
  nn.ReLU(),    
  nn.Linear(10, 10),    
  nn.ReLU(),    
  nn.Linear(10, 10),    
  nn.ReLU(),    
  nn.Linear(10, 10),    
  nn.ReLU(),    
  nn.Linear(10, 10),    
  nn.ReLU(),    
  nn.Linear(10, 10),    
  nn.ReLU(),    
  nn.Linear(10, 3)
)
\`\`\`

## Στόχος
Βελτιστοποιήστε τα βάρη και τις πολώσεις του νευρωνικού δικτύου για να πετύχετε την υψηλότερη δυνατή βαθμολογία ομοιότητας με την εικόνα στόχο.`;export{n as default};
