const n=`Τα **δέντρα αποφάσεων** είναι μια κλασσική τεχνική στην Μηχανική Μάθηση, που επιτρέπει τη μοντελοποίηση πολύπλοκων σχέσεων εισόδων–εξόδων με τρόπο εύκολα κατανοήσιμο από τον άνθρωπο. Βασίζονται στην αυτόματη εκμάθηση μιας ιεραρχικής δομής κανόνων όπου σε κάθε κόμβο γίνεται ένας έλεγχος σε ένα χαρακτηριστικό, μέχρι να καταλήξουμε σε ένα φύλλο που αντιστοιχεί σε μια πρόβλεψη ή κατηγορία.\r
\r
**Στόχος:** Εκπαιδεύστε ταξινομητές Δέντρων Απόφασης (Decision Trees) που μπορούν να προβλέψουν αν ένας φοιτητής θα περάσει ή όχι το μάθημα, με βάση τα παρακάτω χαρακτηριστικά.\r
\r
- Οι προσωπικές ώρες μελέτης ανά εβδομάδα  (0 έως 30 ώρες)\r
- Το ποσοστό παρακολούθησης των μαθημάτων (0 έως 1)\r
- Οι ώρες ύπνου ανά ημέρα (4 έως 10 ώρες)\r
- Το ποσοστό ολοκλήρωσης εργασιών (0 έως 1)\r
- Το επίπεδο στρες (0 έως 1)\r
\r
Για το \`Εύκολο\` επίπεδο χρειάζεστε μόνο να μελετήσετε τα πρώτα δύο χαρακτηριστικά, ενώ για το \`Δύσκολο\` επίπεδο όλα τα χαρακτηριστικά που σας δίνονται. Το δέντρο απόφασης πρέπει να προβλέπει αν ο φοιτητής πέρασε ή όχι το μάθημα (0: δεν πέρασε και 1: πέρασε).\r
\r
\r
**Σημείωση:** Η βαθμολογία που βλέπετε είναι ενδεικτική. Για την αποφυγή υπερμοντελοποίησης (overfitting), η τελική βαθμολογία θα γίνει με βάση την επίδοση των δέντρων σε κρυφό σύνολο δεδομένων που είναι αντίστοιχα με τα δεδομένα εκπαίδευσης και τα φανερά δεδομένα που εμφανίζονται εδώ.`;export{n as default};
