const n=`Στο παιχνίδι **Codenames**, υπάρχει ένα πλέγμα από λέξεις, όπου κάθε λέξη ανήκει σε μία από δύο κατηγορίες: **καλές** (τις οποίες θέλουμε να εντοπίσει ο συμπαίκτης μας) και **κακές** (που πρέπει να αποφευχθούν). Εσύ γνωρίζεις ποιες λέξεις είναι καλές και ποιες κακές, αλλά ο συμπαίκτης σου βλέπει μόνο τις λέξεις χωρίς να γνωρίζει την κατηγορία τους.  

Ο σκοπός σου είναι να καθοδηγήσεις τον συμπαίκτη σου, παρέχοντας του **υποδείξεις** (hints), ώστε να εντοπίσει όλες τις καλές λέξεις με **τον ελάχιστο δυνατό αριθμό υποδείξεων**.  

## Μηχανισμός των υποδείξεων
Κάθε υπόδειξη αποτελείται από:  
- **Μία λέξη** (word) που υπάρχει στο λεξιλόγιο.  
- **Έναν αριθμό $n$**, που δηλώνει ότι ο συμπαίκτης σου πρέπει να μαντέψει τις $n$ πιο σχετικές λέξεις *(που απομένουν)* με βάση την έννοια της υπόδειξης.  

Η σχετικότητα μεταξύ των λέξεων καθορίζεται από **προϋπολογισμένα word embeddings**, τα οποία αναπαριστούν σημασιολογικές ομοιότητες μεταξύ λέξεων. Υποθέτουμε ότι ο συμπαίκτης σου είναι ένας ιδανικός παίκτης (optimal player), που κάθε φορά επιλέγει τις $n$ λέξεις που απομένουν και είναι πιο κοντά στην υπόδειξη με βάση τα embeddings.  

## Στόχος
Ο στόχος είναι να βρούμε μια **στρατηγική** που να παράγει υποδείξεις με τέτοιο τρόπο ώστε:  
- Να **ελαχιστοποιούμε τον αριθμό των υποδείξεων** που απαιτούνται για να εντοπίσει ο συμπαίκτης μας όλες τις καλές λέξεις.  
- Να αποφεύγουμε υποδείξεις που θα μπορούσαν να οδηγήσουν τον συμπαίκτη μας σε κακές λέξεις.  

## Παράδειγμα 
Έστω ότι έχουμε το παρακάτω πλέγμα λέξεων:  


|  |  |  |  |  
| --- | --- | --- | --- |  
| **ΜΗΛΟ** | ΣΚΥΛΟΣ | ΑΥΤΟΚΙΝΗΤΟ | ΓΑΤΑ |  
| ΒΙΒΛΙΟ | **ΔΑΣΟΣ** | ΠΟΔΟΣΦΑΙΡΟ | ΤΡΑΠΕΖΙ |  
| ΧΕΙΜΩΝΑΣ | **ΚΑΡΟΤΟ** | ΠΛΑΖ | **ΒΟΥΝΟ** |  

Οι καλές λέξεις είναι: **ΜΗΛΟ, ΚΑΡΟΤΟ, ΔΑΣΟΣ, ΒΟΥΝΟ**.  

Μια καλή στρατηγική θα μπορούσε να είναι να δώσουμε την υπόδειξη **("ΕΛΑΤΟ", 3)**. Η πιο κοντινή λέξη στο ΕΛΑΤΟ είναι το **ΔΑΣΟΣ**, μετά το **ΒΟΥΝΟ**, μετά το **ΜΗΛΟ** και μετά ο **ΧΕΙΜΩΝΑΣ**. Επιλέγοντας, τον αριθμό 3 μαζί με τη λέξη ΕΛΑΤΟ καλύπτουμε τις περισσότερες καλές λέξεις αποφεύγοντας τη λέξη **ΧΕΙΜΩΝΑΣ** που δεν πρέπει να μαντευτεί.

Έπειτα, μπορούμε να δώσουμε την υπόδειξη **("ΛΑΧΑΝΙΚΟ", 1)** ή **("ΚΑΡΟΤΟ", 1)** για να κατευθύνουμε τον συμπαίκτη μας στο **ΚΑΡΟΤΟ**.  

Έτσι, αντί να δίνουμε μία υπόδειξη για κάθε λέξη, μειώσαμε τον συνολικό αριθμό υποδείξεων σε **μόλις δύο**, επιτυγχάνοντας τον στόχο του παιχνιδιού πιο αποδοτικά.`;export{n as default};
