const n=`Οι διανυσματικές ενθέσεις λέξεων (word embeddings) είναι μια πρωτοποριακή τεχνική στην Επεξεργασία Φυσικής Γλώσσας (NLP), 
που μετατρέπει λέξεις σε αριθμητικά διανύσματα σε έναν πολυδιάστατο χώρο. 
Σε αυτόν τον χώρο, οι λέξεις με παρόμοιο νόημα βρίσκονται κοντά, επιτρέποντας στους 
υπολογιστές να κατανοούν σημασιολογικές και συντακτικές σχέσεις χωρίς να βασίζονται 
αποκλειστικά σε γλωσσικούς κανόνες. Για το πρόβλημα χρησιμοποιούνται τα embeddings 
[fastText](https://fasttext.cc/docs/en/crawl-vectors.html) του Facebook.

**Πρόκληση:** Σύνδεσε δύο τυχαίες λέξεις μέσω μιας αλυσίδας νοηματικά συνδεδεμένων λέξεων. 

**Παράδειγμα:** Ξεκινώντας από την έννοια \`αλυσίδα\` καταλήγουμε στην έννοια \`λέξη\` ως εξής:

\`αλυσίδα\`-\`κρίκος\`-\`συνδετικός\`-\`περιφραστικός\`-\`περίφραση\`-\`λέξη\`

Φτιάξε γέφυρες για τα δοσμένα ζευγάρια λέξεων. Οι **σκούρες** γέφυρες είναι οι πιο καλές και 
έχουν απόσταση 1. Οι **αχνές** έχουν απόσταση 2 ενώ οι 
**διακεκομμένες** είναι μια πιο μακρινή σύνδεση και έχουν απόσταση 3.

Στόχος είναι η μικρότερη διαδρομή. 
**Πόσο κοντά μπορείς να φτάσεις;**`;export{n as default};
