const n=`Το **Skroutz**, η πιο δημοφιλής πλατφόρμα ηλεκτρονικού εμπορίου στην Ελλάδα, φιλοξενεί εκατομμύρια αξιολογήσεις χρηστών για προϊόντα και καταστήματα. Κάθε αξιολόγηση συνοδεύεται από **κείμενο** (π.χ. "Γρήγορη αποστολή, ευγενική εξυπηρέτηση") και μια **βαθμολογία** από το 1 έως το 5.

Ο στόχος αυτού του διαγωνισμού είναι να κατασκευάσετε ένα μοντέλο Μηχανικής Μάθησης που, διαβάζοντας μόνο το **κείμενο της αξιολόγησης**, θα προβλέπει **τη βαθμολογία** που της αντιστοιχεί.


### Στόχος

Δεδομένου του κειμένου μιας αξιολόγησης (review), προβλέψτε τη βαθμολογία της, η οποία είναι ένας ακέραιος αριθμός από το **1** (κακή εμπειρία) έως το **5** (εξαιρετική εμπειρία).

Πέρα από το κείμενο, σας παρέχονται **έτοιμα embeddings** για κάθε κριτική, με **1024 διαστάσεις**, βασισμένα στο μοντέλο **Multilingual-E5-large-instruct**. Αυτά τα embeddings θα σας βοηθήσουν να κατανοήσετε τα συμφραζόμενα των κριτικών και να βελτιώσετε την απόδοση του μοντέλου σας.

### Παραδείγματα

| Κριτική | Βαθμολογία |
|------------------|------------|
| "Το προϊόν ήρθε ακριβώς όπως περιγράφεται και πολύ γρήγορα!" | 5 |
| "Το κατάστημα καθυστέρησε την αποστολή και δεν απαντούσε στα email." | 2 |
| "Η εξυπηρέτηση ήταν μέτρια, αλλά το προϊόν αξίζει τα λεφτά του." | 3 |
| "Λάθος προϊόν και καμία διάθεση για διόρθωση." | 1 |

### Αξιολόγηση

Η πλήρης αξιολόγηση **(full)** θα βασιστεί στο Μέσο Απόλυτο Σφάλμα **(Mean Absolute Error - MAE)** μεταξύ των πραγματικών και των προβλεπόμενων βαθμολογιών για τα κρυφά δεδομένα αξιολόγησης. 

Το μοντέλο σας θα εξεταστεί και σε μια πιο εύκολη υποπερίπτωση **(easy)** όπου θα χρησιμοποιηθούν οι πιο ακραίες αξιολογήσεις (1 και 5). Σε αυτό το υποσύνολο δεδομένων αν το πραγματικό σκορ είναι 5 το μοντέλο σας θα παίρνει πλήρης βαθμό αν προβλέπει 4 ή 5 και μισό βαθμό αν προβλέπει 3. Αντίστοιχα, αν το πραγματικό σκορ είναι 1 το μοντέλο σας θα παίρνει πλήρης βαθμό αν προβλέπει 1 ή 2 και μισό βαθμό αν προβλέπει 3.`;export{n as default};
